Eltopia/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

eltopia_rivet_native.name=Eltopia Rivet (Native USB Port)
eltopia_rivet_native.vid.0=0x2341
eltopia_rivet_native.pid.0=0x804d
eltopia_rivet_native.vid.1=0x2341
eltopia_rivet_native.pid.1=0x004d
eltopia_rivet_native.upload.tool=bossac
eltopia_rivet_native.upload.protocol=sam-ba
eltopia_rivet_native.upload.maximum_size=262144
eltopia_rivet_native.upload.use_1200bps_touch=true
eltopia_rivet_native.upload.wait_for_upload_port=true
eltopia_rivet_native.upload.native_usb=true
eltopia_rivet_native.build.mcu=cortex-m0plus
eltopia_rivet_native.build.f_cpu=48000000L
eltopia_rivet_native.build.usb_product="Eltopia Rivet"
eltopia_rivet_native.build.usb_manufacturer="Eltopia Communications"
eltopia_rivet_native.build.board=SAMD_RIVET
eltopia_rivet_native.build.core=arduino
eltopia_rivet_native.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
eltopia_rivet_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
eltopia_rivet_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
eltopia_rivet_native.build.variant=rivet
eltopia_rivet_native.build.variant_system_lib=
eltopia_rivet_native.build.vid=0x2341
eltopia_rivet_native.build.pid=0x804d
eltopia_rivet_native.bootloader.tool=openocd
eltopia_rivet_native.bootloader.file=rivet/samd21_sam_ba.bin
